#include "WinMain.h"
#include "Animation.h"
// ------------------------------------------------------------
//	アニメーション再生クラス
//	 「0000.png」のファイル形式の画像を指定された枚数読み込み、
//	 指定された速度でアニメーションを再生するクラス
// ------------------------------------------------------------
// ============================================================
//	コンストラクタ
// ============================================================
Animation::Animation()
{
	for (int i = 0; i < MAX_IMG_NUM; ++i)
	{
		img_[i] = -1;
	}
}

// ============================================================
// 画像読み込み
//	戻り値:	なし
//	引数1:	ファイルのパス
//	引数2:	画像の枚数
// ============================================================
void Animation::load(std::string path, int img_num)
{
	for (int i = 0; i < img_num; ++i)
	{
		// 画像がすでに読み込まれていたら削除する
		if (img_[i] != -1)
		{
			DeleteGraph(img_[i]);
		}

		char fname[64];
		sprintfDx(fname, "%s/%04d.png", path.c_str(), i);
		img_[i] = LoadGraph(fname);
	}
	size_ = img_num;
}

// ============================================================
// 再生速度の設定
//	戻り値:	なし
//	引数:	再生速度
// ============================================================
void Animation::setSpeed(int speed)
{
	speed_ = speed;
}

// ============================================================
// アニメーションの再生
//	戻り値:	なし
//	引数:	なし
// ============================================================
void Animation::play()
{
	if (is_stop_ == false)
		return;

	// アニメーションの再生
	is_stop_ = false;
	index_ = 0;
	frame_ = 0;
}

// ============================================================
// 現在の画像の取得
//	戻り値:	画像の中で現在の画像を取得
//	引数:	なし
// ============================================================
int Animation::getImg() const
{
	return img_[index_];
}

// ============================================================
//	更新処理
// ============================================================
void Animation::update()
{
	if (is_stop_ == true)
		return;

	++frame_;
	frame_ %= speed_;
	if (frame_ == 0)
	{
		frame_ = 0;
		++index_;
		index_ %= size_;
		if (index_ == 0)
		{
			is_stop_ = true;
		}
	}
}

// ============================================================
//	終了処理
// ============================================================
void Animation::exit()
{
	for (int i = 0; i < size_; ++i)
	{
		DeleteGraph(img_[i]);
	}
}
