#include "WinMain.h"
#include <algorithm>
// 「Timingゲーム」の作成

// =====================================================
// 定数
// 変数に「const」を付けると、代入禁止の変数（＝定数）となる
// =====================================================
// ゲージの枠（フチ）のサイズ
const float BOX_W = 450.0f;	// 幅
const float BOX_H = 50.0f;	// 高さ

// 移動するバーの枠（フチ）サイズ
const float BAR_W = 10.0f;			// 幅
const float BAR_H = BOX_H - 5.0f;	// 高さ


// =====================================================
//	グローバル変数
//	複数の関数で共通して使いたい変数はここに書く
// =====================================================
// ゲージの枠（フチ）の座標
float box_x = WINDOW_W / 2 - BOX_W / 2;				// X座標
float box_y = WINDOW_H / 2 - BOX_H / 2 - 150.0f;	// Y座標

// 移動するバーの枠（フチ）の座標
float bar_x = WINDOW_W / 2 - BAR_W / 2;				// X座標
float bar_y = WINDOW_H / 2 - BAR_H / 2 - 150.0f;	// Y座標

// =====================================================
//	関数プロトタイプ
// =====================================================


// =====================================================
//		初期化
//	ゲーム開始直後に最初に1回だけ実行される関数
//	最初の値を変数に入れたいときに使う
// =====================================================
void GameInit()
{


}
// =====================================================
//		更新
//	ゲームが終了されるまで実行される関数
//	1秒間に約60回呼ばれる
//	1フレームで行う処理をここに書く
// =====================================================
void GameUpdate()
{


}
// =====================================================
//		描画
//	ゲームが終了されるまで実行される関数
//	1秒間に約60回呼ばれる
//	GameUpdate関数が実行された後に実行される関数
// =====================================================
void GameDraw()
{
	// ゲージの本体を出力
	DrawBoxAA(box_x,		 box_y,
			  box_x + BOX_W, box_y + BOX_H,
			  0x66cdaa, TRUE);
	
	// ゲージの枠（フチ）を出力
	DrawBoxAA(box_x,		 box_y,
			  box_x + BOX_W, box_y + BOX_H,
			  WHITE, FALSE, 2.5f);

	// ゲージの枠（フチ）を出力
	DrawBoxAA(box_x + 1,		 box_y + 1,
			  box_x + BOX_W - 1, box_y + BOX_H - 1,
			  BLACK, FALSE, 0.5f);


	// 移動するバーの本体を出力
	DrawBoxAA(bar_x,		 bar_y,
			  bar_x + BAR_W, bar_y + BAR_H,
			  WHITE, TRUE);
	// 移動するバーの枠（フチ）を出力
	DrawBoxAA(bar_x,		 bar_y,
			  bar_x + BAR_W, bar_y + BAR_H,
			  BLACK, FALSE, 1.5f);
	

}
// =====================================================
//		終了
//	ゲームが終了する前に1回だけ実行される関数
//	何か最後に後片付けを行うときに使う
// =====================================================
void GameExit()
{


}
